---
kind: method
id: M:Autodesk.Revit.DB.Electrical.PanelScheduleView.IsColumnInLoadSummary(System.Int32)
source: html/125d0ab0-650e-67f9-ab3f-a3c2a20eb933.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleView.IsColumnInLoadSummary Method

Check if this column in the load summary

## Syntax (C#)
```csharp
public bool IsColumnInLoadSummary(
	int nCol
)
```

## Parameters
- **nCol** (`System.Int32`) - Column Number

## Returns
Check if this column in the load summary